Revit 2027 API
CurtainGridLine.IsUGridLine Property
Retrieve the direction of a grid line.If it is true,we say it is a UGridLine,otherwise it is VGridLine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUGridLine { get; }
Public ReadOnly Property IsUGridLine As Boolean
	Get
public:
property bool IsUGridLine {
	bool get ();
}
member IsUGridLine : bool with get
Property Value
Boolean
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace